zhuyu9/demo-xibao/esp32/XBBtn/XBBtn.ino
#include <WiFi.h>
#include <driver/i2s.h>
#include <Preferences.h>

#include "M5Atom.h"
#include <ArduinoWebsockets.h>
#include <ArduinoJson.h>
#include <mbedtls/base64.h>

const char *WifiSSID = "Z-HOME";
const char *WifiPWD  = "perfect56";

// Toy Cloud backend config. Use ws:// in local development.
#define TOY_CLOUD_HOST "192.168.3.214"
#define TOY_CLOUD_PORT 8080
#define TOY_CLOUD_WS_PATH "/v1/toy/audio-stream"

#define DEVICE_ID "toy_000123"
#define CHARACTER_ID "shixi"
#define FIRMWARE_VERSION "esp32-xbbtn-0.2.0"
#define LOCALE "zh-CN"

#define AUTH_MODE_DISABLED 0
#define AUTH_MODE_HMAC 1
#define TOY_AUTH_MODE AUTH_MODE_DISABLED
#define TOY_DEVICE_SECRET ""

static String g_requestId;
static String g_sessionId;
static int g_nextAudioSeq = 1;
static int g_expectedAudioSeq = 1;
Preferences g_prefs;
static const char *PREF_NAMESPACE = "toy-cloud";
static const char *PREF_SESSION_ID = "session_id";

#define CONFIG_I2S_BCK_PIN     19
#define CONFIG_I2S_LRCK_PIN    33
#define CONFIG_I2S_DATA_PIN    22
#define CONFIG_I2S_DATA_IN_PIN 23

#define SPEAK_I2S_NUMBER I2S_NUM_0

#define MODE_MIC 0
#define MODE_SPK 1
#define I2S_DMA_BUF_COUNT 6
#define I2S_DMA_BUF_LEN 60

enum DeviceState {
    STATE_IDLE,
    STATE_READY,
    STATE_RECORDING,
    STATE_WAIT_RESULT,
    STATE_PLAYBACK,
    STATE_ERROR,
};

websockets::WebsocketsClient ws_client;
volatile bool isWebSocketConnected = false;
DeviceState g_state = STATE_IDLE;

bool g_wsIntentionalClose = false;
unsigned long g_lastWsActivityAtMs = 0;
unsigned long g_lastWsConnectAttemptAtMs = 0;
static const unsigned long WS_IDLE_DISCONNECT_MS = 15000;
static const unsigned long WS_RECONNECT_BACKOFF_MS = 1500;

#define I2S_READ_CHUNK_SIZE 1024
static uint8_t i2s_read_buffer[I2S_READ_CHUNK_SIZE];
static const size_t AUDIO_BASE64_BUFFER_SIZE = 4 * ((I2S_READ_CHUNK_SIZE + 2) / 3) + 1;
static char g_audioBase64Buffer[AUDIO_BASE64_BUFFER_SIZE];
int g_currentI2SMode = MODE_SPK;
bool g_i2sInstalled = false;
int g_speakerSampleRate = 24000;

// Microphone capture tuning (long-term quality baseline)
// 1) Gain boosts low-level input from PDM mic.
// 2) Soft limiter prevents hard clipping after gain.
// 3) Noise gate reduces background hiss during silence.
// Increase front-end gain because raw PDM input level is consistently low in real runs.
static const float MIC_CAPTURE_GAIN = 4.8f;
static const int16_t MIC_SOFT_LIMIT = 28000;
// Keep this low: hard gate at high threshold will chop syllables and hurt ASR.
static const int16_t MIC_NOISE_GATE = 12;
// Instead of muting to zero, attenuate low-level region to preserve continuity.
static const uint8_t MIC_GATE_ATTENUATION_SHIFT = 1;  // /2
static const unsigned long MIC_STATS_PRINT_INTERVAL_MS = 1000;
static const uint32_t MIC_FADE_IN_SAMPLES = 640;      // 40 ms @ 16 kHz
static const uint32_t MIC_FADE_OUT_SAMPLES = 320;     // 20 ms @ 16 kHz
static const size_t MIC_PRIME_DROP_BYTES = 1280;      // 40 ms @ 16 kHz, s16 mono
static const float MIC_HPF_ALPHA = 0.985f;            // remove low-frequency plosive thump

struct MicCaptureStats {
    uint32_t sampleCount;
    uint32_t gateHitCount;
    uint32_t nearLimitCount;
    uint32_t hardClipCount;
    uint64_t inAbsSum;
    uint64_t outAbsSum;
    uint16_t inPeak;
    uint16_t outPeak;
};

MicCaptureStats g_micStats = {0};
unsigned long g_lastMicStatsPrintAtMs = 0;
uint32_t g_micSessionSampleIndex = 0;
size_t g_micPrimeDropBytesRemaining = 0;
float g_micHpfPrevIn = 0.0f;
float g_micHpfPrevOut = 0.0f;

#define SPEAKER_RING_BUFFER_SIZE 65536
#define SPEAKER_PLAY_CHUNK_SIZE 2048
#define SPEAKER_PREBUFFER_BYTES 8192
static uint8_t g_speakerRing[SPEAKER_RING_BUFFER_SIZE];
volatile size_t g_speakerHead = 0;
volatile size_t g_speakerTail = 0;
volatile bool g_ttsActive = false;
volatile size_t g_ttsBytesInCurrent = 0;
volatile bool g_playbackStarted = false;
volatile bool g_ttsPcmReady = true;
bool g_pcmCarryValid = false;
uint8_t g_pcmCarryByte = 0;

size_t speakerRingUsed() {
    if (g_speakerHead >= g_speakerTail) {
        return g_speakerHead - g_speakerTail;
    }
    return SPEAKER_RING_BUFFER_SIZE - (g_speakerTail - g_speakerHead);
}

size_t speakerRingFree() {
    // Keep 1 byte gap to distinguish full vs empty.
    return SPEAKER_RING_BUFFER_SIZE - speakerRingUsed() - 1;
}

void speakerRingReset() {
    g_speakerHead = 0;
    g_speakerTail = 0;
}

void enqueueSpeakerPcm(const uint8_t *data, size_t len) {
    if (len == 0) {
        return;
    }
    size_t freeBytes = speakerRingFree();
    if (len > freeBytes) {
        size_t drop = len - freeBytes;
        // 向上取整到 2 字节边界，保证 S16LE 对齐。
        // 若 drop 为奇数，tail 会偏移到奇数位置，导致后续所有采样高低字节颠倒，声音变成噪音。
        drop = (drop + 1) & ~((size_t)1);
        g_speakerTail = (g_speakerTail + drop) % SPEAKER_RING_BUFFER_SIZE;
    }
    for (size_t i = 0; i < len; ++i) {
        g_speakerRing[g_speakerHead] = data[i];
        g_speakerHead = (g_speakerHead + 1) % SPEAKER_RING_BUFFER_SIZE;
    }
    g_ttsBytesInCurrent += len;
}

void enqueueSpeakerPcmS16(const uint8_t *data, size_t len) {
    if (len == 0) {
        return;
    }
    if (g_pcmCarryValid) {
        uint8_t pair[2] = {g_pcmCarryByte, data[0]};
        enqueueSpeakerPcm(pair, 2);
        g_pcmCarryValid = false;
        data += 1;
        len -= 1;
    }
    size_t evenLen = len & ~((size_t)1);
    if (evenLen > 0) {
        enqueueSpeakerPcm(data, evenLen);
    }
    if ((len & 1) == 1) {
        g_pcmCarryByte = data[len - 1];
        g_pcmCarryValid = true;
    }
}

void loadSessionID() {
    g_prefs.begin(PREF_NAMESPACE, false);
    g_sessionId = g_prefs.getString(PREF_SESSION_ID, "");
    if (g_sessionId.length() > 0) {
        Serial.printf("[session] loaded session_id=%s\n", g_sessionId.c_str());
    } else {
        Serial.println("[session] no stored session_id");
    }
}

void saveSessionID(const String &sessionId) {
    if (sessionId.length() == 0) {
        return;
    }
    g_sessionId = sessionId;
    bool ok = g_prefs.putString(PREF_SESSION_ID, sessionId) > 0;
    Serial.printf("[session] save %s session_id=%s\n", ok ? "ok" : "failed", sessionId.c_str());
}

void clearSessionID() {
    g_sessionId = "";
    bool ok = g_prefs.remove(PREF_SESSION_ID);
    Serial.printf("[session] clear %s\n", ok ? "ok" : "failed");
}

void markWsActivity();

String makeRequestID() {
    return String("req_") + DEVICE_ID + "_" + String((uint32_t)millis());
}

String base64EncodeBytes(const uint8_t *data, size_t len) {
    if (!data || len == 0) {
        return "";
    }
    if (len > I2S_READ_CHUNK_SIZE) {
        Serial.println("[b64] input too large");
        return "";
    }
    size_t outLen = 0;
    if (mbedtls_base64_encode((unsigned char *)g_audioBase64Buffer, AUDIO_BASE64_BUFFER_SIZE - 1, &outLen, data, len) != 0) {
        Serial.println("[b64] encode failed");
        return "";
    }
    g_audioBase64Buffer[outLen] = '\0';
    return String(g_audioBase64Buffer);
}

bool sendJsonDocument(JsonDocument &doc, const char *tag) {
    String payload;
    payload.reserve(measureJson(doc) + 1);
    serializeJson(doc, payload);
    bool ok = ws_client.send(payload);
    if (ok) {
        markWsActivity();
    }
    Serial.printf("[ws][send] %s %s bytes=%u\n", tag, ok ? "ok" : "failed", (unsigned int)payload.length());
    return ok;
}

bool sendSessionStart() {
    g_requestId = makeRequestID();
    g_nextAudioSeq = 1;
    g_expectedAudioSeq = 1;

