zhuyu9/demo-xibao/esp32/XBBtn/XBBtn.ino
    StaticJsonDocument<512> doc;
    doc["type"] = "session.start";
    doc["request_id"] = g_requestId;
    doc["device_id"] = DEVICE_ID;
    doc["character_id"] = CHARACTER_ID;
    if (g_sessionId.length() > 0) {
        doc["session_id"] = g_sessionId;
    }
    doc["locale"] = LOCALE;
    doc["firmware_version"] = FIRMWARE_VERSION;
    JsonObject audio = doc.createNestedObject("audio");
    audio["format"] = "pcm";
    audio["sample_rate"] = 16000;
    audio["channels"] = 1;
    return sendJsonDocument(doc, "session.start");
}

bool sendAudioAppend(const uint8_t *data, size_t len) {
    if (!data || len == 0) {
        return true;
    }
    String encoded = base64EncodeBytes(data, len);
    if (encoded.length() == 0) {
        return false;
    }

    StaticJsonDocument<1792> doc;
    doc["type"] = "audio.append";
    doc["seq"] = g_nextAudioSeq++;
    doc["audio"] = encoded;
    return sendJsonDocument(doc, "audio.append");
}

bool sendAudioFinish() {
    StaticJsonDocument<96> doc;
    doc["type"] = "audio.finish";
    return sendJsonDocument(doc, "audio.finish");
}

bool InitI2SSpeakOrMic(int mode) {
    esp_err_t err = ESP_OK;

    if (g_i2sInstalled) {
        i2s_driver_uninstall(SPEAK_I2S_NUMBER);
        g_i2sInstalled = false;
    }
    i2s_config_t i2s_config = {
        .mode        = (i2s_mode_t)(I2S_MODE_MASTER),
        .sample_rate = (mode == MODE_MIC) ? 16000 : g_speakerSampleRate,
        .bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT,
        .channel_format = I2S_CHANNEL_FMT_ALL_RIGHT,
#if ESP_IDF_VERSION > ESP_IDF_VERSION_VAL(4, 1, 0)
        .communication_format = I2S_COMM_FORMAT_STAND_I2S,
#else
        .communication_format = I2S_COMM_FORMAT_I2S,
#endif
        .intr_alloc_flags = ESP_INTR_FLAG_LEVEL1,
        .dma_buf_count    = I2S_DMA_BUF_COUNT,
        .dma_buf_len      = I2S_DMA_BUF_LEN,
        .use_apll = false,
        .tx_desc_auto_clear = true,
    };

    if (mode == MODE_MIC) {
        i2s_config.mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX | I2S_MODE_PDM);
    } else {
        i2s_config.mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_TX);
    }

    err = i2s_driver_install(SPEAK_I2S_NUMBER, &i2s_config, 0, NULL);
    if (err != ESP_OK) {
        Serial.printf("i2s_driver_install error: %d\n", err);
        return false;
    }
    g_i2sInstalled = true;

    i2s_pin_config_t tx_pin_config;
#if (ESP_IDF_VERSION > ESP_IDF_VERSION_VAL(4, 3, 0))
    tx_pin_config.mck_io_num = I2S_PIN_NO_CHANGE;
#endif
    tx_pin_config.bck_io_num   = CONFIG_I2S_BCK_PIN;
    tx_pin_config.ws_io_num    = CONFIG_I2S_LRCK_PIN;
    tx_pin_config.data_out_num = CONFIG_I2S_DATA_PIN;
    tx_pin_config.data_in_num  = CONFIG_I2S_DATA_IN_PIN;

    err = i2s_set_pin(SPEAK_I2S_NUMBER, &tx_pin_config);
    if (err != ESP_OK) {
        Serial.printf("i2s_set_pin error: %d\n", err);
        return false;
    }

    int sampleRate = (mode == MODE_MIC) ? 16000 : g_speakerSampleRate;
    err = i2s_set_clk(SPEAK_I2S_NUMBER, sampleRate, I2S_BITS_PER_SAMPLE_16BIT, I2S_CHANNEL_MONO);
    if (err != ESP_OK) {
        Serial.printf("i2s_set_clk error: %d\n", err);
        return false;
    }

    if (mode == MODE_MIC) {
        i2s_zero_dma_buffer(SPEAK_I2S_NUMBER);
    }

    g_currentI2SMode = mode;
    return true;
}

void setState(DeviceState next) {
    g_state = next;
    switch (next) {
        case STATE_IDLE:
            M5.dis.drawpix(0, CRGB(0, 0, 64));
            break;
        case STATE_READY:
            M5.dis.drawpix(0, CRGB(0, 255, 0));
            break;
        case STATE_RECORDING:
            M5.dis.drawpix(0, CRGB(255, 255, 0));
            break;
        case STATE_WAIT_RESULT:
            M5.dis.drawpix(0, CRGB(0, 128, 255));
            break;
        case STATE_PLAYBACK:
            M5.dis.drawpix(0, CRGB(255, 0, 255));
            break;
        default:
            M5.dis.drawpix(0, CRGB(255, 0, 0));
            break;
    }
}

bool ensureI2SMode(int mode) {
    if (g_currentI2SMode == mode) {
        return true;
    }
    return InitI2SSpeakOrMic(mode);
}

bool connectWifi() {
    WiFi.mode(WIFI_STA);
    WiFi.setSleep(false);
    WiFi.begin(WifiSSID, WifiPWD);

    Serial.println("Connecting to WiFi...");
    setState(STATE_IDLE);

    unsigned long start = millis();
    while (WiFi.status() != WL_CONNECTED) {
        delay(500);
        Serial.print('.');
        if (millis() - start > 20000) {
            Serial.println("\nWiFi Connection Failed");
            setState(STATE_ERROR);
            return false;
        }
    }

    Serial.println("\nWiFi connected");
    Serial.print("IP: ");
    Serial.println(WiFi.localIP());
    return true;
}


void onWebsocketMessage(websockets::WebsocketsMessage message);
void onWebsocketEvent(websockets::WebsocketsEvent event, String data);
void resetMicCaptureStats();
void printMicCaptureStats(const char *tag);
void maybePrintMicCaptureStats();
void applyMicFadeOutTail(uint8_t *data, size_t len);
bool isWsConnectionRequired(bool buttonPressed);
void closeDeviceWebSocketIfOpen(const char *reason);

void markWsActivity() {
    g_lastWsActivityAtMs = millis();
}

bool isWsConnectionRequired(bool buttonPressed) {
    if (buttonPressed && g_state == STATE_READY) {
        return true;
    }
    return g_state == STATE_RECORDING ||
           g_state == STATE_WAIT_RESULT ||
           g_state == STATE_PLAYBACK ||
           g_ttsActive;
}

void closeDeviceWebSocketIfOpen(const char *reason) {
    if (g_wsIntentionalClose) {
        return;
    }
    if (!isWebSocketConnected && !ws_client.available()) {
        return;
    }
    g_wsIntentionalClose = true;
    Serial.printf("[ws] close idle connection: %s\n", reason);
    ws_client.close();
    isWebSocketConnected = false;
}

bool connectDeviceWebSocket() {
    g_lastWsConnectAttemptAtMs = millis();
    ws_client.onMessage(onWebsocketMessage);
    ws_client.onEvent(onWebsocketEvent);

    Serial.printf("Connect ws://%s:%d%s\n", TOY_CLOUD_HOST, TOY_CLOUD_PORT, TOY_CLOUD_WS_PATH);

    bool ok = ws_client.connect(TOY_CLOUD_HOST, TOY_CLOUD_PORT, TOY_CLOUD_WS_PATH);
    if (!ok) {
        isWebSocketConnected = false;
        Serial.println("[ws] connect failed");
        return false;
    }

    isWebSocketConnected = true;
    g_wsIntentionalClose = false;
    markWsActivity();
    return true;
}

void startVoiceSession() {
    if (!isWebSocketConnected || !ws_client.available()) {
        Serial.println("ws not connected");
        setState(STATE_ERROR);
        return;
    }

    if (!sendSessionStart()) {
        setState(STATE_ERROR);
        return;
    }

    if (!ensureI2SMode(MODE_MIC)) {
        setState(STATE_ERROR);
        return;
    }

    resetMicCaptureStats();
    Serial.printf("[mic] gain=%.2f gate=%d soft_limit=%d\n", MIC_CAPTURE_GAIN, MIC_NOISE_GATE, MIC_SOFT_LIMIT);
    Serial.println("voice session started");
    setState(STATE_RECORDING);
}

void finishVoiceSession() {
    if (!isWebSocketConnected || !ws_client.available()) {
        return;
    }

    if (!sendAudioFinish()) {
        setState(STATE_ERROR);
        return;
    }

