zhuyu9/demo-xibao/esp32/XBBtn/XBBtn.ino
    Serial.println("session finish sent");
    printMicCaptureStats("session");
    setState(STATE_WAIT_RESULT);
}

void writeSpeakerPcm(const uint8_t *data, size_t len) {
    if (!ensureI2SMode(MODE_SPK)) {
        setState(STATE_ERROR);
        return;
    }

    size_t offset = 0;
    while (offset < len) {
        size_t written = 0;
        esp_err_t err = i2s_write(
            SPEAK_I2S_NUMBER,
            data + offset,
            len - offset,
            &written,
            120 / portTICK_PERIOD_MS
        );
        if (err != ESP_OK) {
            Serial.printf("i2s_write error: %d\n", err);
            setState(STATE_ERROR);
            return;
        }
        if (written == 0) {
            break;
        }
        offset += written;
    }
}

static inline int16_t clampS16(int32_t v) {
    if (v > 32767) return 32767;
    if (v < -32768) return -32768;
    return (int16_t)v;
}

static inline uint16_t absS16(int16_t v) {
    if (v >= 0) return (uint16_t)v;
    if (v == -32768) return 32768;
    return (uint16_t)(-v);
}

void resetMicCaptureStats() {
    g_micStats = {0};
    g_lastMicStatsPrintAtMs = millis();
    g_micSessionSampleIndex = 0;
    g_micPrimeDropBytesRemaining = MIC_PRIME_DROP_BYTES;
    g_micHpfPrevIn = 0.0f;
    g_micHpfPrevOut = 0.0f;
}

void printMicCaptureStats(const char *tag) {
    if (g_micStats.sampleCount == 0) {
        return;
    }

    float inAvg = (float)g_micStats.inAbsSum / (float)g_micStats.sampleCount;
    float outAvg = (float)g_micStats.outAbsSum / (float)g_micStats.sampleCount;
    float gatePct = ((float)g_micStats.gateHitCount * 100.0f) / (float)g_micStats.sampleCount;
    float nearLimitPct = ((float)g_micStats.nearLimitCount * 100.0f) / (float)g_micStats.sampleCount;
    float clipPct = ((float)g_micStats.hardClipCount * 100.0f) / (float)g_micStats.sampleCount;

    Serial.printf(
        "[mic][%s] n=%u in_peak=%u out_peak=%u in_avg=%.1f out_avg=%.1f gate=%.2f%% near_limit=%.2f%% clip=%.3f%%\n",
        tag,
        (unsigned int)g_micStats.sampleCount,
        (unsigned int)g_micStats.inPeak,
        (unsigned int)g_micStats.outPeak,
        inAvg,
        outAvg,
        gatePct,
        nearLimitPct,
        clipPct
    );

    if (g_micStats.inPeak < 7000 && nearLimitPct < 1.0f) {
        Serial.println("[mic][hint] raw input level is low; front-end mic gain is likely insufficient.");
    } else if (g_micStats.inPeak > 22000 || nearLimitPct > 8.0f || clipPct > 0.2f) {
        Serial.println("[mic][hint] front-end level is high; reduce gain to avoid distortion risk.");
    } else {
        Serial.println("[mic][hint] front-end input level is in a usable range.");
    }
}

void maybePrintMicCaptureStats() {
    unsigned long now = millis();
    if (now - g_lastMicStatsPrintAtMs >= MIC_STATS_PRINT_INTERVAL_MS) {
        printMicCaptureStats("live");
        g_lastMicStatsPrintAtMs = now;
    }
}

void processMicPcmInplace(uint8_t *data, size_t len) {
    if (!data || len < 2) {
        return;
    }
    size_t samples = len / 2;
    for (size_t i = 0; i < samples; ++i) {
        int16_t sample = (int16_t)((uint16_t)data[i * 2] | ((uint16_t)data[i * 2 + 1] << 8));
        uint16_t inAbs = absS16(sample);
        if (inAbs > g_micStats.inPeak) {
            g_micStats.inPeak = inAbs;
        }
        g_micStats.inAbsSum += inAbs;

        // 1st-order high-pass filter: y[n] = x[n]-x[n-1] + a*y[n-1]
        // This attenuates low-frequency bursts from plosives / handling.
        float x = (float)sample;
        float y = x - g_micHpfPrevIn + MIC_HPF_ALPHA * g_micHpfPrevOut;
        g_micHpfPrevIn = x;
        g_micHpfPrevOut = y;

        int32_t amplified = (int32_t)(y * MIC_CAPTURE_GAIN);
        int16_t s = clampS16(amplified);

        // Fade-in avoids click caused by abrupt non-zero waveform start.
        if (g_micSessionSampleIndex < MIC_FADE_IN_SAMPLES) {
            int32_t scaled = ((int32_t)s * (int32_t)g_micSessionSampleIndex) / (int32_t)MIC_FADE_IN_SAMPLES;
            s = (int16_t)scaled;
        }

        // Low-level attenuation (soft gate): reduce hiss without cutting speech frames.
        if (s < MIC_NOISE_GATE && s > -MIC_NOISE_GATE) {
            s = (int16_t)(s >> MIC_GATE_ATTENUATION_SHIFT);
            g_micStats.gateHitCount += 1;
        } else {
            // Soft-knee limiter near full scale to avoid clipping artifacts.
            if (s > MIC_SOFT_LIMIT) {
                int32_t over = s - MIC_SOFT_LIMIT;
                s = (int16_t)(MIC_SOFT_LIMIT + over / 4);
                if (s > 32767) s = 32767;
            } else if (s < -MIC_SOFT_LIMIT) {
                int32_t over = -MIC_SOFT_LIMIT - s;
                s = (int16_t)(-MIC_SOFT_LIMIT - over / 4);
                if (s < -32768) s = -32768;
            }
        }

        uint16_t outAbs = absS16(s);
        if (outAbs > g_micStats.outPeak) {
            g_micStats.outPeak = outAbs;
        }
        g_micStats.outAbsSum += outAbs;
        if (outAbs >= (uint16_t)(MIC_SOFT_LIMIT - 1000)) {
            g_micStats.nearLimitCount += 1;
        }
        if (s == 32767 || s == -32768) {
            g_micStats.hardClipCount += 1;
        }
        g_micStats.sampleCount += 1;
        g_micSessionSampleIndex += 1;

        data[i * 2] = (uint8_t)(s & 0xFF);
        data[i * 2 + 1] = (uint8_t)((s >> 8) & 0xFF);
    }
}

void applyMicFadeOutTail(uint8_t *data, size_t len) {
    if (!data || len < 2) {
        return;
    }
    size_t samples = len / 2;
    size_t fadeSamples = (samples < MIC_FADE_OUT_SAMPLES) ? samples : MIC_FADE_OUT_SAMPLES;
    if (fadeSamples == 0) {
        return;
    }

    size_t fadeStart = samples - fadeSamples;
    for (size_t i = 0; i < fadeSamples; ++i) {
        size_t idx = fadeStart + i;
        int16_t s = (int16_t)((uint16_t)data[idx * 2] | ((uint16_t)data[idx * 2 + 1] << 8));
        uint32_t remain = (uint32_t)(fadeSamples - i);
        int32_t scaled = ((int32_t)s * (int32_t)remain) / (int32_t)fadeSamples;
        int16_t out = (int16_t)scaled;
        data[idx * 2] = (uint8_t)(out & 0xFF);
        data[idx * 2 + 1] = (uint8_t)((out >> 8) & 0xFF);
    }
}

void processSpeakerPlayback() {
    size_t used = speakerRingUsed();
    if (!g_playbackStarted) {
        if (used >= SPEAKER_PREBUFFER_BYTES || (!g_ttsActive && used > 0)) {
            g_playbackStarted = true;
        } else {
            return;
        }
    }

