zhuyu9/demo-xibao/esp32/XBBtn/XBBtn.ino
    if (used == 0) {
        if (!g_ttsActive && g_state == STATE_PLAYBACK) {
            setState(STATE_READY);
        }
        return;
    }

    if (!ensureI2SMode(MODE_SPK)) {
        setState(STATE_ERROR);
        return;
    }

    uint8_t chunk[SPEAKER_PLAY_CHUNK_SIZE];
    size_t take = used;
    if (take > sizeof(chunk)) {
        take = sizeof(chunk);
    }

    for (size_t i = 0; i < take; ++i) {
        chunk[i] = g_speakerRing[g_speakerTail];
        g_speakerTail = (g_speakerTail + 1) % SPEAKER_RING_BUFFER_SIZE;
    }
    writeSpeakerPcm(chunk, take);
}

void setup() {
    M5.begin(true, false, true);
    M5.dis.clear();
    Serial.begin(115200);

    delay(200);
    Serial.println("XBBtn Booting...");
    loadSessionID();

    InitI2SSpeakOrMic(MODE_SPK);
    setState(STATE_IDLE);

    if (!connectWifi()) {
        return;
    }

    setState(STATE_READY);
}

void onWebsocketMessage(websockets::WebsocketsMessage message) {
    markWsActivity();
    if (message.isText()) {
        String text = message.c_str();
        Serial.printf("[ws] %s\n", text.c_str());

        StaticJsonDocument<512> doc;
        if (deserializeJson(doc, text)) {
            return;
        }

        String type = doc["type"].as<String>();
        if (type == "asr") {
            String asrText = doc["text"].as<String>();
            bool isFinal = doc["is_final"] | false;
            Serial.printf("[asr]%s %s\n", isFinal ? " [FINAL]" : "", asrText.c_str());
        } else if (type == "error") {
            Serial.printf("[ws] error: %s\n", doc["message"].as<String>().c_str());
            setState(STATE_ERROR);
        } else if (type == "tts.start") {
            g_ttsActive = true;
            g_ttsBytesInCurrent = 0;
            g_playbackStarted = false;
            g_pcmCarryValid = false;
            speakerRingReset();
            int sr = doc["sample_rate"] | 24000;
            if (sr < 8000 || sr > 48000) {
                sr = 24000;
            }
            g_speakerSampleRate = sr;
            String fmt = doc["format"].as<String>();
            int channels = doc["channels"] | 1;
            g_ttsPcmReady = (fmt == "pcm_s16le" && channels == 1);
            if (!g_ttsPcmReady) {
                Serial.printf("[tts] unsupported stream fmt=%s ch=%d\n", fmt.c_str(), channels);
            }
            Serial.printf("[tts] start sr=%d ch=%d fmt=%s voice=%s\n",
                          g_speakerSampleRate,
                          channels,
                          fmt.c_str(),
                          doc["voice"].as<String>().c_str());
            if (g_state != STATE_RECORDING) {
                setState(STATE_PLAYBACK);
            }
        } else if (type == "tts.end") {
            g_ttsActive = false;
            g_ttsPcmReady = true;
            g_pcmCarryValid = false;
            Serial.printf("[tts] end bytes=%u buffered=%u\n",
                          (unsigned int)g_ttsBytesInCurrent,
                          (unsigned int)speakerRingUsed());
            if (g_state != STATE_RECORDING && speakerRingUsed() == 0) {
                g_playbackStarted = false;
                setState(STATE_READY);
            }
        }
        return;
    }

    const std::string &raw = message.rawData();
    if (!raw.empty()) {
        if (g_state != STATE_RECORDING) {
            if (!g_ttsPcmReady) {
                return;
            }
            if (raw.length() > 4096) {
                Serial.printf("[ws] drop large binary frame: %u\n", (unsigned int)raw.length());
                return;
            }
            setState(STATE_PLAYBACK);
            enqueueSpeakerPcmS16((const uint8_t *)raw.data(), raw.length());
        }
    }
}

void onWebsocketEvent(websockets::WebsocketsEvent event, String data) {
    if (event == websockets::WebsocketsEvent::ConnectionOpened) {
        isWebSocketConnected = true;
        g_wsIntentionalClose = false;
        markWsActivity();
        Serial.println("[ws] opened");
        if (g_state == STATE_IDLE || g_state == STATE_ERROR) {
            setState(STATE_READY);
        }
    } else if (event == websockets::WebsocketsEvent::ConnectionClosed) {
        bool wasIntentional = g_wsIntentionalClose;
        g_wsIntentionalClose = false;
        isWebSocketConnected = false;
        if (wasIntentional) {
            Serial.println("[ws] closed (intentional)");
            if (g_state == STATE_ERROR || g_state == STATE_IDLE) {
                setState(STATE_READY);
            }
            return;
        }

        Serial.println("[ws] closed (unexpected)");
        if (g_state == STATE_RECORDING || g_state == STATE_WAIT_RESULT || g_state == STATE_PLAYBACK || g_ttsActive) {
            setState(STATE_ERROR);
        } else {
            setState(STATE_READY);
        }
    } else if (event == websockets::WebsocketsEvent::GotPing) {
        // ignore
    } else if (event == websockets::WebsocketsEvent::GotPong) {
        markWsActivity();
    } else {
        Serial.printf("[ws] event %d\n", event);
    }
}

void loop() {
    M5.update();

    if (WiFi.status() != WL_CONNECTED) {
        Serial.println("WiFi disconnected, reconnecting...");
        setState(STATE_ERROR);
        WiFi.reconnect();
        delay(500);
        return;
    }

    ws_client.poll();
    bool buttonPressed = M5.Btn.isPressed();
    unsigned long now = millis();

    bool needWs = isWsConnectionRequired(buttonPressed);
    if (needWs) {
        if (!ws_client.available() && (now - g_lastWsConnectAttemptAtMs >= WS_RECONNECT_BACKOFF_MS)) {
            if (!connectDeviceWebSocket() && g_state != STATE_READY) {
                setState(STATE_ERROR);
            }
        }
    } else if (ws_client.available() && (now - g_lastWsActivityAtMs >= WS_IDLE_DISCONNECT_MS)) {
        closeDeviceWebSocketIfOpen("idle timeout");
    }

    if (g_state == STATE_READY && buttonPressed) {
        if (!ws_client.available()) {
            if (now - g_lastWsConnectAttemptAtMs >= WS_RECONNECT_BACKOFF_MS) {
                if (!connectDeviceWebSocket()) {
                    setState(STATE_ERROR);
                }
            }
        } else {
            startVoiceSession();
        }
    }

    if (g_state == STATE_RECORDING) {
        size_t bytesRead = 0;
        esp_err_t readErr = i2s_read(
            SPEAK_I2S_NUMBER,
            (char *)i2s_read_buffer,
            I2S_READ_CHUNK_SIZE,
            &bytesRead,
            (60 / portTICK_PERIOD_MS)
        );

        bool shouldFinish = M5.Btn.isReleased();

        if (readErr == ESP_OK && bytesRead > 0 && isWebSocketConnected && ws_client.available()) {
            uint8_t *sendPtr = i2s_read_buffer;
            size_t sendLen = bytesRead;

            // Drop very first samples after switching to MIC mode to absorb startup transients.
            if (g_micPrimeDropBytesRemaining > 0) {
                size_t drop = (sendLen < g_micPrimeDropBytesRemaining) ? sendLen : g_micPrimeDropBytesRemaining;
                sendPtr += drop;
                sendLen -= drop;
                g_micPrimeDropBytesRemaining -= drop;
            }

            if (sendLen > 0) {
                processMicPcmInplace(sendPtr, sendLen);
                if (shouldFinish) {
                    applyMicFadeOutTail(sendPtr, sendLen);
                }
                maybePrintMicCaptureStats();
                if (!sendAudioAppend(sendPtr, sendLen)) {
                    setState(STATE_ERROR);
                    return;
                }
            }
        }

        if (shouldFinish) {
            finishVoiceSession();
        }
    }

    if (g_state == STATE_PLAYBACK || g_ttsActive) {
        processSpeakerPlayback();
    }

    delay(2);
}
